leetcode_1235_maximum_profit_in_job_scheduling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1235. Maximum Profit in Job Scheduling</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1235. Maximum Profit in Job Scheduling</h1>
<ul class="org-ul">
<li><a href="mistake_overcomplicated_solution.html#ID-40E38FD2-DDF0-4C25-BB8C-43D07F3D5136">Mistake: Overcomplicated solution</a>.  Tried to save memory by keeping</li>

<li><a href="pre_processing_the_input_can_make_easier_to_solve_the_original_problem.html#ID-42B21DBC-4951-4AF2-8C41-A646F5675365">Can we pre-process the input in a way to make easy to solve the problem?</a>  Sort the jobs by start time.  <a href="how_could_you_find_the_optimal_interval_knowing_a_tiny_part_of_it.html#ID-29DB5011-3209-4B10-BAA5-823D1ADB9F47">How could we find the optimal interval knowing a tiny part of it?</a>  If the job is part of the solution, it means that you can only extend it after the job's end.  To find the next job, we can search for the job that starts on that time with a <a href="binary_search.html#ID-1217FC3D-A9F9-49EC-BA5D-A68E50338DBD">Binary-search</a>.  Time complexity is \(O(n \log n)\) and space is \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List
<span style="font-weight: bold;">from</span> bisect <span style="font-weight: bold;">import</span> bisect_left


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">jobScheduling</span>(
        <span style="font-weight: bold;">self</span>, startTime: List[<span style="font-weight: bold;">int</span>], endTime: List[<span style="font-weight: bold;">int</span>], profit: List[<span style="font-weight: bold;">int</span>]
    ) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(startTime)
        <span style="font-weight: bold; font-style: italic;">s</span> = []
        <span style="font-weight: bold; font-style: italic;">e</span> = []
        <span style="font-weight: bold; font-style: italic;">p</span> = []
        <span style="font-weight: bold;">for</span> a, b, c <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">sorted</span>(<span style="font-weight: bold;">zip</span>(startTime, endTime, profit)):
            s.append(a)
            e.append(b)
            p.append(c)

        <span style="font-weight: bold; font-style: italic;">dp</span> = [0] * (N + 1)
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N - 1, -1, -1):
            <span style="font-weight: bold; font-style: italic;">dp</span>[<span style="font-weight: bold; font-style: italic;">i</span>] = <span style="font-weight: bold;">max</span>(dp[i + 1], p[i] + dp[bisect_left(s, e[i], lo=i + 1)])

        <span style="font-weight: bold;">return</span> dp[0]


<span style="font-weight: bold;">assert</span> Solution().jobScheduling([1, 2, 3, 3], [3, 4, 5, 6], [50, 10, 40, 70]) == 120
<span style="font-weight: bold;">assert</span> (
    Solution().jobScheduling([1, 2, 3, 4, 6], [3, 5, 10, 6, 9], [20, 20, 100, 70, 60])
    == 150
)
<span style="font-weight: bold;">assert</span> Solution().jobScheduling([1, 1, 1], [2, 3, 4], [5, 6, 4]) == 6
</pre>
</div>
</div>
</body>
</html>